Repository: mozilla-l10n/mt-training-data
Catalog: ln/ln_pontoon.tmx
Source language: en_us
Languages: ln

source: Enter your email address here.
ln: Koma adresse email nayo awa.

source: Enter your reply here.
ln: Koma eyano nayo awa.

source: Enter your terms in the form below and click <strong>Search</strong>
ln: Koma maloba nayo ya boluki na formulaire oyo eza awa na se mpe cliquer <strong>Luka</strong>

source: Error messages: what they mean and how to fix
ln: Bamessage ya erreur: oyo elingi koloba mpe ndenge ya kobongisa

source: Escalated
ln: Ekitisami

source: Events and help for Mentors
ln: Milulu mpe lisalisi mpo na ba Mentors

source: Every time Firefox opened
ln: Tango inso Firefox efungwami

source: Example:
ln: Ndakisa:

source: Exit Survey Results
ln: Bima na Baresultat ya Enquete

source: Expiry date:
ln: Mokolo ya kosila ngala:

source: Expiry Date
ln: Mokolo ngala ekosila

source: Explanation:
ln: Botatoli:

source: Explore more topics
ln: Kundola ba sujets misusu

source: Extension/plugin you are having trouble with
ln: Extension/bibakisi oyo eza kopesa yo nkokoso

source: Extensions
ln: Baextension

source: Facebook URL
ln: URL Facebook

source: Fill in details
ln: Tondisa badétail

source: Filter by
ln: Filtrer na

source: Filter by Locale
ln: Filtrage kolandana na Lokota

source: Filter by Product
ln: Filtrage kolandana na Produit

source: Filter questions
ln: Filtrer mituna

source: Finally, if you want to follow all news related to SUMO, don’t forget about our
ln: Mpo na kosilisa, soki olingi kolanda bansango nionso oyo etali SUMO, kobosana te maye matali

source: Finally, if you want to follow all news related to SUMO, don’t forget about our <a href="%(forums_url)s">community forums</a>, <a href="%(blog_url)s">official blog</a> and <a href="%(twitter_url)s">Twitter account</a>. We also <a href="%(meetings_url)s"> meet almost every Monday </a> - and you can join us.
ln: Mpo na kosilisa, soki olingi kolanda basango nionso oyo etali SUMO, kobosana te maye matali <a href="%(forums_url)s">baforum ya lingomba nabiso</a>, <a href="%(blog_url)s">official blog</a> mpe <a href="%(twitter_url)s">compte Twitter</a>. Tokutanaka mpe <a href="%(meetings_url)s"> pene mikolo nionso ya mosala moko </a> - mpe okoki kosangana nabiso.

source: Find your fellow contributors
ln: Kuta baninga nayo bacontributeur

source: Firefox 29 Launch Team
ln: Equipe ya lancement Firefox 29

source: Firefox controls and buttons
ln: Bacontôle mpe ba boutons ya Firefox

source: Firefox crashes
ln: Firefox ezwi likama

source: Firefox for Android
ln: Firefox mpo na Android

source: Firefox for iOS
ln: Firefox mpo na iOS

source: Firefox for iPhone, iPad and iPod touch devices
ln: Firefox mpo na baappareil ya toucher iPhone, iPad mpe iPod

source: Firefox for Windows 8 Touch
ln: Firefox mpo na Windows 8 Touch

source: Firefox for Windows 8 touch devices
ln: Firefox mpo na baappareil ya toucher Windows 8

source: Firefox is slow or stops working
ln: Firefox eza kosala malembe to etiki kosala

source: Firefox options, preferences and settings
ln: Baoption, bapréférence mpe baparamètre ya Firefofox

source: Firefox OS basics
ln: Mateya ya ebandeli ya Firefox OS

source: Firefox OS SMS & email
ln: SMS & email Firefox OS

source: Firefox Releases
ln: Bapublication Ya Firefox

source: Firefox Sync
ln: Sync Firefox

source: Firefox Sync settings
ln: Baparamètre ya Sync Firefox

source: Firefox version
ln: version Firefox

source: Firefox versions and languages
ln: Baversion ya Firefox mpe bankota

source: Firefox won't save settings or remember information
ln: Firefox ekokoka te kobomba baparamètre to kokanisa bainfo

source: Fix problems
ln: Kobongisa bankokoso

source: Fix problems with email providers (gmail, Yahoo, etc.)
ln: Bongisa bankokoso na bafournisseur ya email (gmail, Yahoo, etc.)

source: Fix problems with websites (Facebook, YouTube, webmail etc.)
ln: Kobongisa bankokoso ya ba sites web (Facebook, YouTube, webmail etc.)

source: Fix slowness, crashing, error messages and other problems
ln: Kobongisa bolembu, makama, bamessage ya erreur mpe bankokoso misusu

source: Flagged:
ln: Etiyamaki bendele:

source: Flagged Content Pending Moderation
ln: Contenu eye Etiyami Bendele Ekozela Moderation

source: Flagged {t} (Reason: {r})
ln: Etiyami bendele {t} (Ntina: {r})

source: Flagging a user to ignore will prevent their tweets from showing up in Army of Awesome.
ln: Kotiya bendele na mosaleli ya kokipe te ekokanga nzela na ba tweets naye mpo emonana te na Ebele ya Kosepelisa.

source: Focus on people who need help or have questions
ln: Tiya misu nayo na batu oyo basengeli na lisalisi to baza na mituna

source: Follow through. Sometimes, our volunteers would ask you for more information or to test out certain scenarios. The sooner you can do this, the sooner they would know how to fix it.
ln: Landela. Tango mosusu, bavolontaire nabiso bakoki kotuna yo bainfo misusu to komeka ba nzela misusu. Ezali yo kosala yango na lombango, nde na lombango mpe bakoki kobongisa yango.

source: For Contributors
ln: Mpo na Bacontributeur

source: Forgotten your password? Enter your email address below, and we'll send you instructions for setting a new one.
ln: Obosani liloba nayo ya sekele? Koma adresse email nayo awa na se, mpe tokotindela yo mitindo mpo na koréinitialiser oyo ya sika.

source: Forgotten your username? Enter your email address below, and we'll send it to you.
ln: Obosani nkombo nayo ya bosaleli? Koma adresse email nayo awa na se, mpe tokotindela yo yango.

source: For help with writing articles, check out the <a href="%(url)s">Support Document Guide</a>.
ln: Mpo na kosalisa kokoma baarticles, tala <a href="%(url)s">Guide Ya Lisungi Ya Document</a>.

source: Forum Contributor - Answer user support questions that are most-requested but have no replies:
ln: Contributeur ya Forum - Koyanola mituna ya lisungi miye mitunamaka mingi kasi miza na biyano te mpo na mosaleli:

source: Found <strong>{n}</strong> result for <strong>{q}</strong> for <strong>{product}</strong>
ln: Resultat oyo <strong>{n}</strong> ezwami mpo na <strong>{q}</strong> mpo na <strong>{product}</strong>

source: Free Download
ln: Téléchargement Ya Ofele

source: From:
ln: Kowuta na:

source: From hardcore web developers to "how do I install Firefox" first time users, everybody needs your help in the forum! Share your knowledge by pointing people to the right help articles and providing troubleshooting steps for their individual questions.
ln: Kowuta na badeveloppeur ya hardcore kino na "Ndenge nini nakoki koinstaller Firefox" mosaleli ya mbala ya yambo, mutu nionso asengeli na lisalisi na forum! Kobola boyebi nayo na bolakisi batu baarticle ya lisalisi oyo esengeli mpe kolakisa baetape ya dépannage mpo na mituna nabango.

source: from the comfort of your couch
ln: uta na oyo ekosenga yo makasi mingi te

source: Full Article Sources
ln: Ba Sources Complètes Ya Article

source: Get community support
ln: Kozwa lisungi ya lingomba

source: Get emailed when there is new discussion activity in my locale.
ln: Kozwa ba email tango lisolo yasika eza na lokota nangai.

source: Get email updates
ln: Zwa ba mise à jour na email

source: Get personal
ln: Komisa yango personnel

source: Get started
ln: Mpo na kobanda

source: Get support for another platform:
ln: Zwa lisungi mpo na plateforme mosusu:

source: Get the most from webmaker.org
ln: Zwa ya malamu koleka na webmaker.org

source: Give Firefox a tune up
ln: Tiya Firefox maboko

source: Give our users actionable and informed choices by informing and educating at the point of collection and providing a choice to opt-out whenever possible.
ln: Kopesa na basaleli nabiso banzela ya kopona eye bakoki kolanda mpe eye basosoli na nzela ya koyebisa mpe koteya bango na tango balingi kosomba mpe kopesa bango choix oyo bakoki kopona tango esengeli.

source: Glad to hear it!
ln: Esengo koyoka yango!

source: Glad to hear it &mdash; thanks for the feedback!
ln: Esengo koyoka yango &mdash; matango mingi mpo na feedback!

source: Go
ln: Banda

source: Go back to document history
ln: Zonga na lisitwale ya document

source: Go back to the question.
ln: Zonga na motuna.

source: Go back to the question and try again.
ln: Zonga na motuna mpe meka lisusu.

source: Go beyond the basics with these shortcuts and other tips.
ln: Leka niveau ya ebandeli na ba raccourcis oyo mpe mayele misusu.

source: Go to Army of Awesome
ln: Kende na Army of Awesome

source: Go to our support forum and choose a question to answer
ln: Kende na forum nabiso ya lisungi mpe pona motuna ya koyanola

source: Go to the SUMO community discussions forum
ln: Kende na forum ya masolo ya lingomba ya SUMO

source: Graphics
ln: Bagraphique

source: {group} | Groups
ln: {group} | Bagroupe

source: Group information updated successfully!
ln: Mise à jour ya bansango ya groupe esalemi malamu!

source: Group Leaders
ln: Bakambi ya groupe

source: Group Members
ln: Bamembre Ya Groupe

source: Groups
ln: Bagroupe

source: Recently awarded &quot;%(badge_name)s&quot; badges
ln: Oyo epesami kala te &quot;%(badge_name)s&quot; badges

source: Has answers
ln: Eza na biyano

source: Has been sent a first answer contribution email.
ln: Atindelami email ya yambo ya contribution ya eyano.

source: Has been sent a first revision contribution email.
ln: Atindelami email ya yambo ya contribution ya revision.

source: hash
ln: putulu

source: Has helpful answers
ln: Eza na biyano ya ntina

source: has this problem
ln: eza na nkokoso oyo

source: Have a question about Army of Awesome?
ln: Oza motuna na maye matali Ebele ya Kosepelisa?

source: Have more to say?
ln: Oza na mingi ya koloba?

source: Have video or voice conversations using the Firefox browser
ln: Sala masolo ya vidéo to mongongo na bosaleli navigateur Firefox

source: Having an account on the support forums lets us notify you when you get a response on your question
ln: Kozala na compte na baforum ya lisungi ekopesa biso nzela toyebisa yo tango eyano ezwami mpo na motuna nayo

source: Having trouble with a Mozilla product and want some help?
ln: Ozwi nkokoso na produit ya Mozilla mpe olingi mua lisalisi?

source: Having trouble with Firefox and want some help? Our support forums are a great place to ask a question.
ln: Oza na nkokoso na Firefox mpe olingi kozwa mua lisalisi? Bafurm nabiso ya lisungi eza esika monene ya kotuna mituna.

source: Help articles are not available in your language yet? You want to join the amazing team translating them? You will help millions of users in your language. Pretty heroic, right?
ln: Baarticle ya lisalisi ezwami te na lokota nayo? Olingi kosangana na lingomba ya kosepelisa liye lizali kolimbola yango? Okosalisa bamillion ya basaleli na lokota nayo. Kitoko, bompiliki, malamu?

source: Help Articles Only
ln: Bobele Baarticle Ya Lisalisi

source: helpful
ln: Ya ntina

source: Helpful
ln: Ya ntina

source: Helpfulness
ln: Bopesi ntina

source: Helpfulness of KB articles and Forum
ln: Ya ntina na baarticle Oyo Etali Boyebi me Forum

source: Helpful Reply
ln: Biyano ya ntina

source: Helpful Solutions
ln: Basolution Ya Ntina

source: Helpful votes
ln: Bavotes ya ntina

source: Helpful Votes
ln: Bavote Ya Ntina

source: Help millions of users get the most out of their favourite browser. Your contributions will reach millions of users worldwide, and you can do it from the comfort of your couch!
ln: Salisa bamillion ya basaleli bazwa ya litomba koleka na navigateur nabango balingaka. Bacontribution nayo ekokomela bamillion ya basaleli mokili mobimba, mpe okoki kosala yango na bompete bisika ozali.

source: Help on Twitter
ln: Lisalisi na Twitter

source: Help or get help on a Webmaker project.
ln: Salisa to zwa lisalisi na projet Webmaker.

source: Help other Firefox users by browsing for unsolved questions on {host}:
ln: Salisa basaleli misusu ya Firefox na koluka mituna miye miyanolami te na {host}:

source: Help other users
ln: Salisa basaleli misusu

source: Help Other Users
ln: Salisa Basaleli Misusu

source: Help teach digital skills and share creative ways of teaching technology.
ln: Salisa kotangisa mayele ya numérique mpe kabola banzela ya créativité ya botangisi technologie.

source: Help the Open Badges community
ln: Salisa lingomba ya Ba Badges Ya Kofungwama

source: Help Topics
ln: Basujet Ya Lisalisi

source: Help users in the forums
ln: Salisa basaleli na baforum

source: Help users on Twitter
ln: Salisa basaleli na Twitter

source: Help us write help articles
ln: Salisa biso kokoma baarticle ya lisalisi

source: Help us write help articles!
ln: Salisa biso kokoma baarticle ya lisalisi!

source: Help Us Write Help Articles
ln: Salisa Biso Kokoma Baarticle ya Lisalisi

source: Help with:
ln: Salisa na:

source: Hide details &raquo;
ln: Batamisa badétail &raquo;

source: History
ln: Lisitwale

source: History of {title}
ln: Lisitwale ya {title}

source: Hi {username}
ln: Mbote {username}

source: Hi {username},
ln: Mbote {username},

source: Hot topics
ln: Basujet ya Kafukafu

source: How does it work?
ln: Esalaka ndenge nini?

source: How it works
ln: Ndenge esalaka

source: How to
ln: Ndenge ya

source: How To
ln: Ndenge Ya Kosala

source: How to be effective:
ln: Ndenge ya kozala effectif:

source: How to configure and customize Firefox for Windows 8 Touch.
ln: Ndenge ya koconfigurer mpe kopersonnaliser Firefox mpo na Windows 8 Touch.

source: How to contribute
ln: Ndenge ya kocontirbuer

source: How To Contribute
ln: Ndenge Ya Kocontribuer

source: How to download, manage and use your favorite apps on your Firefox OS phone.
ln: Ndenge ya kotélécharger, kokamba mpe kosalela baapps nayo olingaka na telefone nayo Firefox OS.

source: How to install and keep Firefox for Android up to date
ln: Ndenge ya koinstaller mpe kosala ete Firefox mpo na Android ezala à jour

source: How to install and keep Thunderbird up to date
ln: Ndenge ya koinstaller mpe kosala mise à jour ya Thunderbird

source: How to install Firefox and keep it up to date
ln: Ndenge ya koinstaller Firefox mpe kosala ete ezala à jour

source: How to troubleshoot error messages on Firefox
ln: Ndenge ya kobongisa bamessage ya erreur na Firefox

source: How to use bookmarks, tabs and basic Firefox features on your iOS device
ln: Ndenge ya kosalela ba bookmarks, ba tabs mpe bacarctèristique ya base ya Firefox na appareil nayo iOS

source: How to use Firefox's privacy and security features
ln: Ndenge ya kosalela bacaractéristique ya Firefox ya confidentialité mpe bokengi

source: How to use the address book on Thunderbird
ln: Ndenge ya kosalela répertoire na Thunderbird

source: I already have an account
ln: Naza déjà na compte

source: I am providing the requested information
ln: Naza kopesa bainfo oyo esengamaki

source: Identifying common problems helps the community answer your questions more quickly.
ln: Koidentifier bankokoso oyo ezwaka batu nionso esalisaka lingomba koyanola mituna nayo na lombango.

source: I didn't get a confirmation email.
ln: Nazwi email ya confirmation te.

source: If checked, this document allows discussion in an associated forum. Uncheck to hide/disable the forum.
ln: Soki etiyami elembo, document oyo ekozala kondima masolo na forum associé. Longola elembo mpo na kobatamisa/desactivé forum.

source: If checked, this document needs updates.
ln: Soki etiyami elembo, document oyo ekosengela na ba mise à jour.

source: If checked, this wiki page will be hidden from basic searches and dashboards. When viewed, the page will warn that it is no longer maintained.
ln: Soki etiyami elembo, wiki oyo ekobatama na boluki basique mpe batableuax de bord. Tango bakozala kotala yango, lokasa ekokebisa ete eza lisusu entretenu te.

source: I forgot my username.
ln: Nabosani nkombo nangai ya bosaleli.

source: If the link above doesn’t work, click here:
ln: Soki lien oyo eza awa likolo ezosala te, cliquer awa:

source: If this answer solves your problem, please mark it as "solved":
ln: Soki eyano oyo esilisi nkokoso nayo, tiya elembo neti "endimbolami":

source: If this comment is helpful, vote on it:
ln: Soki commentaire oyo eza ya ntina, voter yango:

source: If this doesn't solve your problem, let {answerer} know by replying on the website:
ln: Soki eyanoli nkokoso nayo te, yebisa {answerer} na boyanoli na site web:

source: If you are interested in learning more about how this whole support thing works, check out our <a href="%(training_url)s"> contributor training </a>. This includes some cool troubleshooting info, guidelines, how-to questions, and info about where to find more help if stuck.
ln: Soki osepeli koyekola ebele na maye matali ndenge lisungi nionso oyo liza kosalema, tala <a href="%(training_url)s"> mateya nabiso mpo na contributeur </a>. Yango ezali na bainfo ya kitoko mpo na dépannage, badirective, mituna mitali ndenge ya kosala, mpe bainfo na maye matali esika ya kozwa lisalisi mosusu tango na nkokoso.

source: If you are interested in learning more about how this whole support thing works, check out our contributor training. This includes some cool troubleshooting info, guidelines, how-to questions, and info about where to find more help if stuck.
ln: Soki olingi koyekola ebele na maye matali ndenge lisungi nionso oyo ezosala, tala contributeur nabiso ya mateya. Yango eza na bainfo kitoko ya dépannage, badirective, mituna ya ndenge ya kosalela mpe bainfo na maye matali wapi lisalisi mosusu likoki kozwama tango na nkokoso.

source: If you did not request this email there is no need for further action.
ln: Soki osengaki email oyo te, eza na eloko moko te oyo esengeli osala.

source: If you did not request this email, there is no need for further action.
ln: Soki osengaki email oyo te, eza na eloko mote oyo esengeli osala.

source: If you have a moment please help us by reviewing these articles:
ln: Soki oza na mua ntango salisa biso na bomenyoli baarticle oyo:

source: If you have a moment please review these articles:
ln: Soki oza na mua ntango manyola baarticle oyo:

source: If you have any questions about localization priorities, please contact %(email_link)s.
ln: Soki oza na mituna na maye matali bapriorité ya ndimbola, komela %(email_link)s.

source: If you know what you are doing, you can edit the document anyway.
ln: Soki oyebi maye ozali kosala, okoki nayo mpe kaka kokoba kobongisa document.

source: If you like writing and teaching then the Knowledge Base is the place for you. We need contributors that can write, edit or proof read articles in English. Thousands of people are accessing our Knowledge Base every week. Imagine how many will be helped by you!
ln: Soki olingaka kokoma mpe kotangisa nayango Oyo Etali Boyebi eza esika mpo na yo. Tosengeli na bacontributeur baye bakoki kokoma, kobongisa to reviser baarticle na lokota ya Angele. Ebele ya batu bakoingela na Oyo Etali Boyebi nabiso poso nionso. Banza kaka batu boni bakosalisama na nzela nayo!

source: If you need help with Firefox, please <a href="%(aaq_url)s">ask a question</a>.
ln: Soki osengeli na lisalisi ya Firefox, <a href="%(aaq_url)s">tuna motuna</a>.

source: If you submit information to Mozilla when you crash, you'll be given a crash ID which uniquely identifies your crash and lets us look at details that may help identify the cause. To find your recently submitted crash IDs, go to <strong>about:crashes</strong> in your location bar. <a href='http://support.mozilla.com/en-US/kb/Firefox+crashes#Getting_the_most_accurate_help_with_your_Firefox_crash' target='_blank'>Click for detailed instructions</a>.
ln: Soki otindi bainfo na Mozilla ntango ya likama, bakopesa yo Identifiant ya likama eye eza koidentifier bobele likama nayo mpe kopesa nzela ya botali badétail oyo ekoki kosalisa koidentifier ntina ya likama. Mpo na kozwa baidentifiant ya likama eye otindaki kala te, kende na <strong>maye matali:makama</strong> na barre nayo ya adresse. <a href='http://support.mozilla.com/en-US/kb/Firefox+crashes#Getting_the_most_accurate_help_with_your_Firefox_crash' target='_blank'>Cliquer mpo na kozwa bainstruction misusu</a>.

source: Ignore
ln: Kokipe te

source: Ignored Users
ln: Kokipe Basaleli te

source: Ignore User
ln: Kokipe mosaleli te

source: I have feedback about Firefox
ln: Naza na feedback na maye matali Firefox

source: I have this problem, too
ln: Naza mpe na nkokoso oyo

source: I invited {user} to a screen sharing session, and I'll give an update here once we are done.
ln: Nabengisi {user} na session ya masolo na écran, mpe nakopesa sango awa tango tokosilisa.

source: Image
ln: Elili

source: Image:
ln: Elili:

source: Images
ln: Bilili

source: Immediate Update Needed
ln: Esengeli na Mise à jour Sik'oyo

source: Import settings from other browsers
ln: Benda baparamètre kowuta banavigateur misusu

source: Improve our help articles
ln: Améliorer baarticle nabiso ya lisalisi

source: Inbox
ln: Sanduku ya mikanda oyo eye

source: Include obsolete articles?
ln: Kobakisa baarticle oyo esili ngala?

source: Include this in wiki syntax with [[Image:title]]
ln: Kotisa yango kati ya wiki syntax na [[Image:title]]

source: In English
ln: Na Angele

source: In order to prevent spam, we are limiting the number of answers that can be posted within a short period of time. If you want to post more please create a post on the <a href="%(url)s">contributors forum</a> requesting that you be white-listed.
ln: Mpo na koéviter spam, tosukisi motango ya biyano oyo ekoki kokotisama na eleko mokuse ya tango. Soki olingi kokotisa ebele sala article na <a href="%(url)s">forum ya bacontributeur</a> oyo eza kosenga ete bapesa yo nzela.

source: Install and keep Firefox up to date on your iPad, iPhone or iPod Touch.
ln: Installer mpe sala ete Firefox ezala à jour na iPad, iPhone to iPod Touch.

source: Install and update
ln: Koinstaller mpe kosala mise à jour

source: Install and Update
ln: Installer mpe Sala mise à jour

source: Installation Issues
ln: Bankokoso Ya Installation

source: Installed plugins
ln: Bibakisi biye bizali installé

source: Installed Plug-ins
ln: Bibakisi oyo eza installé

source: Install, Migrate and Update
ln: Installation, Migration mpe Mise à jour

source: Install open apps from the Marketplace to add more fun and functionality to your device
ln: Installer baapps ya kofungwama uta Marketplace mpo na kobakisa mingi ya kosepelisa mpe fonctionnalité na appareil nayo

source: Internet and Connections
ln: Internet mpe Baconnection

source: Interval
ln: Intervalle

source: Introduce yourself
ln: Milakisa

source: Intro to Open Badges
ln: Intro na Ba Badges Ya Kofungwama

source: Invalid callback function.
ln: Fonction ya rappel elongobani te.

source: Invalid field
ln: Esika elongobani te

source: Invalid ID.
ln: Identifiant elongobani te.

source: Invalid or no image received.
ln: Elili elongobani te to eyambami te.

source: Invalid search data.
ln: Badonnée ya boluki elongobani te.

source: Invalid username provided. Enter a new username below.
ln: Nkombo ya bosaleli oyo epasami elongobani te. Koma nkombo ya bosaleli yasika awa na se.

source: Invite to share screen
ln: Invitation ya masolo na écran

source: IRC nickname
ln: Nkombo ya kobamba IRC

source: Is approved?
ln: Endimami?

source: Is current revision?
ln: Eza revisé sik'oyo?

source: Issue Badges
ln: Pesa Ba Badges

source: Issue digital badges to acknowledge new skills and achievements
ln: Pesa ba badges numérique mpo na kondima mayele yasika mpe maye masaleli

source: Issued on:
ln: Epesami mokolo ya:

source: Issue submitted successfully
ln: Likambo litindami malamu

source: It looks like you've bookmarked an old URL. The new URL for this page is below. You should update your bookmarks. We will forward you to the new URL in 10 seconds.
ln: Emonani neti otiye bookmark na URL yakala. URL yasika mpo na lokasa oyo eza awa na se. Esengeli osala mise à jour ya ba bookmark nayo. Tokotindela yo URL yasika na basenconde 10.
